mermaid replacement
